Revit 2027 API
DirectContext3DHandleSettings.SetColor Method
 Sets the color of the handle and the associated DirectContext3D graphics.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetColor(
	Color color
)
Public Sub SetColor (
	color As Color
)
public:
void SetColor(
	Color^ color
)
member SetColor :
        color : Color -> unit
Parameters
color Color
 The color to apply.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace